


Diameter Maintenance and                                J. Korhonen, Ed.
Extensions (DIME)                                            TeliaSonera
Internet-Draft                                              J. Bournelle
Intended status: Standards Track                      France Telecom R&D
Expires: May 17, 2008                                       K. Chowdhury
                                                        Starent Networks
                                                       November 14, 2007


  Diameter Proxy Mobile IPv6: Support For Mobility Access Gateway and
          Local Mobility Anchor to Diameter Server Interaction
                    draft-korhonen-dime-pmip6-01.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on May 17, 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2007).

Abstract

   This specification defines the Diameter support for the Proxy Mobile
   IPv6.  The policy information needed by the Proxy Mobile IPv6 is
   defined in mobile node's policy profile, which gets downloaded from
   the Diameter server to the Mobile Access Gateway once the mobile node



Korhonen, et al.          Expires May 17, 2008                  [Page 1]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   roams into a Proxy Mobile IPv6 Domain and performs the access
   authentication.  The access authentication procedure into the Proxy
   Mobile IPv6 Domain resembles the Mobile IPv6 integrated scenario
   bootstrapping.  Rather than defining a completely new set of
   attributes or a new Diameter application this specification only
   leverages the work already done for the Mobile IPv6 bootstrapping.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Terminology and Abbreviations  . . . . . . . . . . . . . . . .  4
   3.  Solution Overview  . . . . . . . . . . . . . . . . . . . . . .  5
   4.  Attribute Value Pair Definitions . . . . . . . . . . . . . . .  7
     4.1.  PMIP6-MAG-Address  . . . . . . . . . . . . . . . . . . . .  7
     4.2.  MIP6-Agent-Info  . . . . . . . . . . . . . . . . . . . . .  7
     4.3.  PMIP6-IPv4-Home-Address  . . . . . . . . . . . . . . . . .  7
     4.4.  PMIP6-DHCP-Address . . . . . . . . . . . . . . . . . . . .  7
     4.5.  PMIP6-Home-Prefix  . . . . . . . . . . . . . . . . . . . .  7
     4.6.  PMIP6-MN-FQDN  . . . . . . . . . . . . . . . . . . . . . .  8
     4.7.  MIP6-Feature-Vector  . . . . . . . . . . . . . . . . . . .  8
     4.8.  Chargeable-User-Identity . . . . . . . . . . . . . . . . .  9
     4.9.  Calling-Station-Id . . . . . . . . . . . . . . . . . . . .  9
     4.10. Called-Station-Id  . . . . . . . . . . . . . . . . . . . . 10
     4.11. Session-Timeout  . . . . . . . . . . . . . . . . . . . . . 10
   5.  MAG to HAAA Interface Application Support, Commands Codes
       and Attribute Value Pairs  . . . . . . . . . . . . . . . . . . 10
     5.1.  Application Support and Command Codes  . . . . . . . . . . 10
     5.2.  Diameter-EAP-Request (DER) . . . . . . . . . . . . . . . . 10
     5.3.  Diameter-EAP-Answer (DEA)  . . . . . . . . . . . . . . . . 11
     5.4.  AA-Request (AAR) . . . . . . . . . . . . . . . . . . . . . 12
     5.5.  AA-Answer (AAA)  . . . . . . . . . . . . . . . . . . . . . 13
     5.6.  Accounting at MAG  . . . . . . . . . . . . . . . . . . . . 13
   6.  LMA to HAAA Interface Application Support, Commands Codes
       and Attribute Value Pairs  . . . . . . . . . . . . . . . . . . 13
     6.1.  Application Support and Command Codes  . . . . . . . . . . 13
     6.2.  Authorization of the Proxy Binding Update  . . . . . . . . 14
       6.2.1.  AA-Request (AAR) . . . . . . . . . . . . . . . . . . . 15
       6.2.2.  AA-Answer (AAA)  . . . . . . . . . . . . . . . . . . . 15
     6.3.  MAG to LMA Security Association Setup  . . . . . . . . . . 16
     6.4.  Accounting at LMA  . . . . . . . . . . . . . . . . . . . . 17
   7.  Proxy Mobile IPv6 Session Management . . . . . . . . . . . . . 17
     7.1.  Session Termination Request - Command  . . . . . . . . . . 17
     7.2.  Session Termination Answer - Command . . . . . . . . . . . 17
     7.3.  Abort Session Request - Command  . . . . . . . . . . . . . 17
     7.4.  Abort Session Answer - Command . . . . . . . . . . . . . . 17
   8.  Attribute Value Pair Occurrence Tables . . . . . . . . . . . . 17
   9.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 19



Korhonen, et al.          Expires May 17, 2008                  [Page 2]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


     9.1.  Attribute Value Pair Codes . . . . . . . . . . . . . . . . 19
     9.2.  Namespaces . . . . . . . . . . . . . . . . . . . . . . . . 20
     9.3.  Application Identifiers  . . . . . . . . . . . . . . . . . 20
     9.4.  Result-Code AVP Values . . . . . . . . . . . . . . . . . . 20
   10. Security Considerations  . . . . . . . . . . . . . . . . . . . 20
   11. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 20
   12. References . . . . . . . . . . . . . . . . . . . . . . . . . . 20
     12.1. Normative References . . . . . . . . . . . . . . . . . . . 20
     12.2. Informative References . . . . . . . . . . . . . . . . . . 21
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 22
   Intellectual Property and Copyright Statements . . . . . . . . . . 23








































Korhonen, et al.          Expires May 17, 2008                  [Page 3]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


1.  Introduction

   In the Proxy Mobile IPv6 (PMIPv6) protocol [1] and its IPv4 support
   [2] a Mobile Access Gateway (MAG) performs a proxy registration with
   a Local Mobility Anchor (LMA) on behalf of the mobile node (MN).  In
   order to perform the proxy registration the PMIPv6 MAG needs the
   address of the LMA, MN's home network prefix (MN-HNP), possibly MN's
   IPv4 home address (IPv4-HoA), DHCP server address and other PMIPv6
   specific information such as allowed address configuration modes and
   possible roaming related policies.  All this information is defined
   in MN's policy profile that gets downloaded from the Diameter server
   to the MAG once the MN roams into a Proxy Mobile IPv6 Domain (PMIPv6-
   Domain) and performs the access authentication.

   Dynamic assignment and downloading of PMIPv6 policy profile
   information is a desirable feature to ease the deployment and network
   maintenance of larger PMIPv6 deployments.  For this purpose, the AAA
   infrastructure, which is used for access authentication, can be
   leveraged to assign some or all of the necessary parameters.  The
   Diameter server in the Mobility Service authorizer's (MSA) or in the
   Mobility Service Provider's (MSP) network may return these parameters
   to the Network Access Server (NAS).

   Once the MN authenticates to the network the MAG or actually the
   integrated Proxy Mobile Agent (PMA) sends the Proxy Binding Update
   (PBU) towards the LMA on behalf of the MN.  Upon arrival of the PBU
   the LMA needs to interact with the Diameter server and fetch the MN's
   policy related information that was already partially downloaded to
   the MAG.

   This specification defines the Diameter support for the PMIPv6.  In
   the context of this specification the location of the subscriber
   policy profile equals to the home Diameter server, which is also
   referred as the home AAA server (HAAA).  The NAS functionality of the
   MAG may be co-located or integral part of the MAG.  The access
   authentication procedure into a PMIPv6-Domain resembles the Mobile
   IPv6 integrated scenario bootstrapping [3].  The assumption is that
   the Access Service Authenticator (ASA) is the same entity as the MSA/
   MSP.  This specification leverages the work already done for the
   Mobile IPv6 integrated scenario bootstrapping [3].


2.  Terminology and Abbreviations

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC2119 [4].




Korhonen, et al.          Expires May 17, 2008                  [Page 4]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   General mobility terminology can be found in [12].  The following
   additional or clarified terms are used in this document:

   Network Access Server (NAS):

      A device that provides an access service for a user to a network.
      In the context of this document the NAS may be integrated into or
      co-located to a MAG.  The NAS contains a Diameter client function.

   Home AAA (HAAA):

      An authentication, authorization and accounting server located in
      user's home network.  A HAAA is essentially a Diameter server.



3.  Solution Overview

   This document addresses the authentication, authorization, accounting
   and session management functionality needed by the PMIPv6 protocol.
   This document defines Diameter based MAG to HAAA and LMA to HAAA
   interfaces.  The intention of this document is only to extend
   existing Mobile IPv6 specifications such as [3] and define needed
   additional AVPs and functionality to fulfil the needs of the PMIPv6
   deployment.

   The policy profile download from the HAAA to the MAG is part of the
   network access authentication procedure when a MN roams into or
   within a PMIPv6 Domain.  Figure 1 shows the participating network
   entities.  This document, however, only concentrates on the MAG, LMA,
   possible local Diameter proxies and the home Diameter server.  When
   aligned with [3] the MAG acts as the NAS located in ASP, the HAAA
   acts as the Diameter server located in ASA/MSA/MSP and the LMA acts
   as the HA in ASP/MSP.

















Korhonen, et al.          Expires May 17, 2008                  [Page 5]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


    +--------+
    | HAAA & | Diameter +-----+
    | Policy |<-------->| LMA |
    | Profile|          +-----+
    +--------+             | <--- LMA-Address
         ^                 |
         |               // \\
     +---|------------- //---\\----------------+
    (    |  IPv4/IPv6  //     \\                )
    (    |   Network  //       \\               )
     +---|-----------//---------\\-------------+
         |          //           \\
     Diameter      // <- Tunnel1  \\ <- Tunnel2
         |        //               \\
         |        |- MAG-Address1   |- MAG-Address2
         |     +----+             +----+
         +---->|MAG1|             |MAG2|
               +----+             +----+
                  |                 |
                  |                 |
                [MN1]             [MN2]

    Figure 1: Proxy Mobile IPv6 Domain with MAG to HAAA and LMA to HAAA
                                Interfaces

   In a PMIPv6 access scenario a MN attaches to a PMIPv6-Domain and
   starts a network access authentication procedure.  The choice of the
   authentication mechanism is specific to the access network
   deployment, but could be based on the Extensible Authentication
   Protocol (EAP) [13].  During the network access authentication
   procedure, the MAG acting as a NAS queries the HAAA through the AAA
   infrastructure using the Diameter protocol.  If the HAAA detects that
   the subscriber is also authorized for the PMIPv6 service, the
   subscriber policy is returned along with the successful network
   access authentication answer to the MAG.

   During the access authentication procedure the MAG sends a PBU to the
   LMA.  Upon receiving the PBU the LMA interacts with the HAAA and
   fetches the relevant subscriber policy, authorization and security
   information related to the PMIPv6 session.  This specification
   assumes that the HAAA is the central node for managing everything
   related to PMIPv6 subscription and session, possibly even including
   the allocation of prefixes.

   Prior to sending the PBU there might be a need to dynamically setup
   the MAG to LMA Security Association (SA), for example using IKEv2/
   IPSec [14].  The dynamic SA setup procedure may be triggered by the
   MN attaching to the MAG that does not have existing SA with the



Korhonen, et al.          Expires May 17, 2008                  [Page 6]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   correspondent LMA.  The details of the dynamic SA setup procedure is
   out of scope of this specification.  However, the SA is between the
   MAG and the corresponding LMA, thus it can be created using any
   security mechanism that is applicable for PMIPv6 security such as
   IKEv2 IPSec with an EAP-based authentication.  It should be noted
   that the identity used by MAG during the SA creation is MAG's own
   identity and the creadentials are for authenticating the MAG toward
   the LMA.


4.  Attribute Value Pair Definitions

4.1.  PMIP6-MAG-Address

   The PMIP6-MAG-Address AVP (AVP Code TBD) is of type Address and
   contains the IP address of the MAG.  This APV is needed in deployment
   cases where the NAS (also in authenticator's role) and possibly a
   pool of MAGs are not co-located.  In this case the AAA request should
   contain the IP address of the MAG from where the subsequent PBU for
   the registration will originate.  The AAA server may use this
   information, for example, to select such LMA that already has a SA
   set up with the MAG.

4.2.  MIP6-Agent-Info

   The MIP6-Agent-Info grouped AVP is defined in [3].  This document
   reuses the said AVP and its sub-AVPs to carry the LMA IP address
   and/or FQDN.

4.3.  PMIP6-IPv4-Home-Address

   The PMIP6-IPv4-Home-Address AVP (AVP Code TBD) is of type Address and
   contains the IPv4-HoA of the MN.

4.4.  PMIP6-DHCP-Address

   The PMIP6-DHCP-Address AVP (AVP Code TBD) is of type Address and
   contains the IP address of the DHCPv4 and/or DHCPv6 server assigned
   to the MAG serving the newly attached MN.  If the AVP contains a
   DHCPv4 server address, then the Address type MUST be IPv4.  If the
   AVP contains a DHCPv6 server address, then the Address type MUST be
   IPv6.

4.5.  PMIP6-Home-Prefix

   The PMIP6-Home-Prefix AVP (AVP Code TBD) is of type Address and
   contains the MN-NHP.  The low 64 bits of the IPv6 address MUST be all
   zeroes.  The high 64 bits of the IPv6 address are used as the MN-HNP.



Korhonen, et al.          Expires May 17, 2008                  [Page 7]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   The PMIP6-Home-Prefix AVP may also be used on the LMA to HAAA
   interface.  In this scenario the AVP contains the prefix the LMA has
   assigned to the MN.  If the LMA delegates assignment of the home
   network prefix to the HAAA, the AVP MUST contain all zeroes address
   in the request message.  The reply message SHOULD in all cases
   contain the assigned home prefix value.

4.6.  PMIP6-MN-FQDN

   The PMIP6-MN-FQDN AVP (AVP Code TBD) is of type DiameterIdentity and
   contains the FQDN assigned for the MN.

4.7.  MIP6-Feature-Vector

   The MIP6-Feature-Vector AVP is originally defined in [3]".  This
   document only reserves new capability bits according to the rules in
   [3].  The new reserved bits contain PMIPv6 capability announcement of
   the MAG and the HAAA(/LMA)).  Using the capability announcement it is
   possible to perform a simple capability negotiation between the MAG
   and the HAAA.  Those capabilities that are announced by both parties
   are also known to be mutually supported.  The following capability
   bits are defined in this document:

   PMIP6_SUPPORTED (0x0000000100000000)

      When the MAG/NAS sets this bit in the MIP6-Feature-Vector AVP, it
      is an indication to the HAAA that the NAS supports PMIPv6.  When
      the HAAA sets this bit in the response MIP6-Feature-Vector AVP, it
      indicates that the HAAA also has PMIPv6 support.  This capability
      bit can also be used to allow PMIPv6 mobility support in a
      subscription granularity.

   IP4_HOA_SUPPORTED (0x0000000200000000)

      Assignment of the IPv4-HoA is supported.  When the MAG sets this
      bit in the MIP6-Feature-Vector AVP, it indicates that the MAG
      implements a minimal functionality of a DHCP server (and a relay)
      and is able to deliver IPv4-HoA to the MN.  When the HAAA sets
      this bit in the response MIP6-Feature-Vector AVP, it indicates
      that the HAAA has authorized the use of IPv4-HoA for the MN.  If
      this bit is unset in the returned MIP6-Feature-Vector AVP, the
      HAAA does not authorize the configuration of IPv4 address.  Use of
      the IP4_HOA_SUPPORTED bit is also an indication of DSMIPv6 support
      [15].







Korhonen, et al.          Expires May 17, 2008                  [Page 8]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   LOCAL_MAG_ROUTING_SUPPORTED (0x0000000400000000)

      Direct routing of IP packets between MNs anchored to the same MAG
      is supported.  When a MAG sets this bit in the MIP6-Feature-
      Vector, it indicates that routing IP packets between MNs anchored
      to the same MAG is supported, without reverse tunneling packets
      via the LMA or requiring any Route Optimization related signaling
      (e.g. the Return Routability Procedure in [16] prior direct
      routing.  If this bit is unset in the returned MIP6-Feature-Vector
      AVP, the HAAA does not authorize direct routing of packets between
      MNs anchored to the same MAG.

   DNS_UPDATE_BY_MAG (0x0000001000000000)

      The MAG indicates its capability and wish to perform a dynamic DNS
      update for recently assigned MN-HoA.  If both MAG and LMA set this
      bit in the capability exchange, then the MAG is authorized to
      perform the dynamic DNS update.

      In a case the MN is roaming, it is highly probable that the MAG
      won't be authorized to perform a dynamic DNS update.  The MAG
      belongs to a different administrative domain than the DNS server
      hosting the naming information for the MN.

   The MIP6-Feature-Vector AVP is also used on the LMA to HAAA
   interface.  Using the capability announcement AVP it is possible to
   perform a simple capability negotiation between the LMA and the HAAA.
   Those capabilities that are announced by both parties are also known
   to be mutually supported.  The capabilities listed in earlier are
   also supported in the LMA to HAAA interface.  The LMA to HAAA
   interface does not define any new capability values.

4.8.  Chargeable-User-Identity

   The Chargeable-User-Identity AVP (AVP Code 89) is of type OctetString
   and in a response message contains the mobile node identifier (MN-
   Identifier) assigned by the AAA server.  The use of the Chargeable-
   User-Identity is defined on RFC 4372 [5].

4.9.  Calling-Station-Id

   The Calling-Station-Id AVP (AVP Code 31) is of type UTF8String and
   contains a MAG provided link layer interface identifier of the
   interface the MN used to attach to the network.  This interface
   identifier may correspond to a real physical interface or something
   that the MAG has generated.  The identifier MUST be unique within the
   PMIPv6 domain.




Korhonen, et al.          Expires May 17, 2008                  [Page 9]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


4.10.  Called-Station-Id

   The Called-Station-Id AVP (AVP Code 30) is of type UTF8String and
   contains a LMA provided service identifier on the LMA to HAAA
   interface.  The service identifier may be used to assist the PBU
   authorization.  The identifier MUST be unique within the PMIPv6
   domain.

4.11.  Session-Timeout

   The Session-Timeout AVP (AVP Code 27) is of type Unsigned32 and
   contains lifetime of the Binding Cache Entry.


5.  MAG to HAAA Interface Application Support, Commands Codes and
    Attribute Value Pairs

5.1.  Application Support and Command Codes

   This document re-uses the Diameter NASREQ [6] and the EAP [7]
   applications and their command codes in the same way as defined in
   [3].  The MAG acts as a Diameter client.

   The MAG to HAAA interface is primarily used for bootstrapping PMIPv6
   when a MN attaches and authenticates to the PMIPv6 capable network.
   This includes the bootstrapping of PMIPv6 session related information
   and possibly PMIPv6 security related information retrieval.  The same
   interface may also be used for accounting.

   Whenever the MAG sends a Diameter message to the HAAA the User-Name
   AVP MUST contain the MN identity.  The identity MUST be in Network
   Access Identifier (NAI) [8] format.

   The Diameter response messages MAY contain Framed-IPv6-Prefix and/or
   Framed-IPv4-Address AVPs.  For example a local Diameter proxy MAY add
   those in order to advertise locally availble prefixes and addresses
   as well [17].  It is also possible that PMIPv6 mobility support is
   not allowed for a subscription.  In this case, a MAG may still
   provide normal IP connectivity to the MN using, for example, local
   address pools.

5.2.  Diameter-EAP-Request (DER)

   The Diameter-EAP-Request (DER) message [7] is sent by the MAG to the
   Diameter server to initiate a network access authentication and
   authorization procedure.  The DER message format is the same as
   defined in [7].  The DER message MAY include optional PMIPv6 MAG to
   HAAA interface AVPs:



Korhonen, et al.          Expires May 17, 2008                 [Page 10]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   <Diameter-EAP-Request> ::= < Diameter Header: 268, REQ, PXY >
                              < Session-Id >
                              { Auth-Application-Id }
                              { Origin-Host }
                              { Origin-Realm }
                              { Destination-Realm }
                              { Auth-Request-Type }
                              ...
                              [ MIP6-Feature-Vector ]
                              [ PMIP6-MAG-Address ]
                              [ Chargeable-User-Identity ]
                              [ Calling-Station-Id ]

                              [ User-Name ]
                              [ Destination-Host ]
                              ...
                            * [ AVP ]

5.3.  Diameter-EAP-Answer (DEA)

   The Diameter-EAP-Answer (DEA) message defined in [7] is sent in
   response to the Diameter-EAP-Request message (DER).  The DEA message
   format is the same as defined in [7].  If the network access
   authentication procedure was successful then the response MAY include
   PMIPv6 MAG to HAAA interface AVPs.  The PMIP6-Home-Prefix AVP
   contains MN-HNP and the PMIP6-IPv4-Home-Address AVP contains IPv4-
   HoA, if such information are needed:
























Korhonen, et al.          Expires May 17, 2008                 [Page 11]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   <Diameter-EAP-Answer> ::= < Diameter Header: 268, PXY >
                             < Session-Id >
                             { Auth-Application-Id }
                             { Auth-Request-Type }
                             { Result-Code }
                             { Origin-Host }
                             { Origin-Realm }
                             ...
                           * [ MIP6-Agent-Info ]
                             [ MIP6-Feature-Vector ]
                             [ PMIP6-MAG-Address ]
                           * [ PMIP6-DHCP-Address ]
                             [ PMIP6-Home-Prefix ]
                             [ PMIP6-IPv4-Home-Address ]
                             [ PMIP6-MN-FQDN ]
                             [ Chargeable-User-Identity ]

                             [ User-Name ]
                             [ Framed-IPv6-Prefix ]
                             [ Framed-IPv4-Address ]
                             ...
                           * [ AVP ]

5.4.  AA-Request (AAR)

   The AA-Request (AAR) message [6] is sent by the MAG to the Diameter
   server to initiate a network access authentication and authorization
   procedure.  The AAR message format is the same as defined in [6].
   The message MAY include optional PMIPv6 MAG to HAAA interface AVPs:

   <AA-Request> ::= < Diameter Header: 265, REQ, PXY >
                    < Session-Id >
                    { Auth-Application-Id }
                    { Origin-Host }
                    { Origin-Realm }
                    { Destination-Realm }
                    { Auth-Request-Type }
                    ...
                    [ MIP6-Feature-Vector ]
                    [ PMIP6-MAG-Address ]
                    [ Chargeable-User-Identity ]
                    [ Calling-Station-Id ]

                    [ User-Name ]
                    [ Destination-Host ]
                    ...
                  * [ AVP ]




Korhonen, et al.          Expires May 17, 2008                 [Page 12]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


5.5.  AA-Answer (AAA)

   The AA-Answer (AAA) message is sent in response to the AA-Request
   (AAR) message.  The AAA message format is the same as defined in [6].
   If the network access authentication procedure was successful then
   the response MAY include PMIPv6 MAG to HAAA interface AVPs.  The
   PMIP6-Home-Prefix AVP contains MN-HNP and the PMIP6-IPv4-Home-Address
   AVP contains IPv4-HoA, if such information are needed:

   <AA-Answer> ::= < Diameter Header: 265, PXY >
                   < Session-Id >
                   { Auth-Application-Id }
                   { Auth-Request-Type }
                   { Result-Code }
                   { Origin-Host }
                   { Origin-Realm }
                   ...
                 * [ MIP6-Agent-Info ]
                   [ MIP6-Feature-Vector ]
                   [ PMIP6-MAG-Address ]
                 * [ PMIP6-DHCP-Address ]
                   [ PMIP6-Home-Prefix ]
                   [ PMIP6-IPv4-Home-Address ]
                   [ Chargeable-User-Identity ]

                   [ User-Name ]
                   [ Framed-IPv6-Prefix ]
                   [ Framed-IPv4-Address ]
                   ...
                 * [ AVP ]

5.6.  Accounting at MAG

   The accounting at the MAG to HAAA interface is based on the [6].  The
   application identifier used for accounting is the Diameter Base
   Accounting (3) [9].

   TBD.


6.  LMA to HAAA Interface Application Support, Commands Codes and
    Attribute Value Pairs

6.1.  Application Support and Command Codes

   The LMA to HAAA interface may be used for multiple purposes.  These
   include the authorization of the incoming PBU, possible PMIPv6
   security related information retrieval, accounting and PMIPv6 session



Korhonen, et al.          Expires May 17, 2008                 [Page 13]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   management.

   This document re-uses the Diameter NASREQ [6] and EAP [7]
   applications and their command codes for the MAG to LMA Security
   Association setup.  The LMA acts as a Diameter client.

   This document defines a new application for the authorization of the
   Proxy Binding Updates.  The new application identifier is TBD BY
   IANA.  The new application re-uses the Diameter NASREQ [6] command
   codes.  The LMA acts as a Diameter client.

6.2.  Authorization of the Proxy Binding Update

   A new Diameter application is needed for the LMA to HAAA interface
   when authorizing Proxy Binding Updates.  The new application
   identifier is TBD BY IANA.  This application re-uses Diameter NASREQ
   AAR and AAA command codes.

   Whenever the LMA sends a Diameter message to the HAAA, the User-Name
   AVP MUST contain the MN identity.  The identity MUST be in a NAI
   format.  The LMA MAY retrieve the MN identity information from the
   PBU MN-ID [18] mobility option.  The identity SHOULD be the same as
   used on the MAG to HAAA interface, but in a case those identities
   differ the HAAA MUST have a mechanism of mapping the MN identity used
   on the MAG to HAAA interface to the identity used on the LMA to HAAA
   interface.

   If the PBU contains the MN interface identifier option, the Calling-
   Station-Id AVP SHOULD be included in the request message containing
   the received interface identifier.  Furthermore, if the PBU contains
   the Service Selection mobility option [19], the Called-Station-Id AVP
   SHOULD be included in the request message containing the received
   service identifier.

   The LMA and the HAAA use the PMIP6-Home-Prefix AVP to exchange the
   MN-HNP when appropriate.  The low 64 bits of the prefix must be all
   zeroes.  Similarly, the LMA and the HAAA use the PMIP6-IPv4-Home-
   Address AVP to exchange the MN IPv4-HoA when appropriate.  If the
   PMIP6-Home-Prefix is set to an undefined address (::/128) in the
   request message, it is an indication that the HAAA needs to assign
   the MN-HNP and return it to the LMA in the response message.  If the
   PMIP6-IPv4-Home-Address is set to all zeroes (0.0.0.0) in the request
   message, it is an indication that the HAAA needs to assign the MN
   IPv4-HoA and return it to the LMA in the response message.

   If the HAAA is not able to authorize the PBU, then the reply message
   to the LMA MUST have the Result-Code AVP set to value
   DIAMETER_PMIP6_AUTHORIZATION_FAILED (TBD BY IANA) indicating a



Korhonen, et al.          Expires May 17, 2008                 [Page 14]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   permanent failure.

6.2.1.  AA-Request (AAR)

   The AA-Request (AAR) message [6] is sent by the LMA to the Diameter
   server to initiate a network access authentication and authorization
   procedure.  The AAR message format is the same as defined in [6].
   The message MAY include optional PMIPv6 LMA to HAAA interface AVPs:

   <AA-Request> ::= < Diameter Header: 265, REQ, PXY >
                    < Session-Id >
                    { Auth-Application-Id }
                    { Origin-Host }
                    { Origin-Realm }
                    { Destination-Realm }
                    { Auth-Request-Type }
                    ...
                    [ MIP6-Agent-Info ]
                    [ MIP6-Feature-Vector ]
                    [ PMIP6-MAG-Address ]
                    [ PMIP6-Home-Prefix ]
                    [ PMIP6-IPv4-Home-Address ]
                    [ Calling-Station-Id ]
                    [ Called-Station-Id ]

                    [ User-Name ]
                    ...
                  * [ AVP ]

6.2.2.  AA-Answer (AAA)

   The AA-Answer (AAA) message is sent in response to the AA-Request
   (AAR) message.  The AAA message format is the same as defined in [6].
   If the network access authentication procedure was successful then
   the response MAY include PMIPv6 LMA to HAAA interface AVPs.  The
   PMIP6-Home-Prefix AVP contains MN-HNP and the PMIP6-IPv4-Home-Address
   AVP contains IPv4-HoA, if such information are needed:














Korhonen, et al.          Expires May 17, 2008                 [Page 15]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   <AA-Answer> ::= < Diameter Header: 265, PXY >
                   < Session-Id >
                   { Auth-Application-Id }
                   { Auth-Request-Type }
                   { Result-Code }
                   { Origin-Host }
                   { Origin-Realm }
                   ...
                   [ MIP6-Feature-Vector ]
                   [ PMIP6-Home-Prefix ]
                   [ PMIP6-IPv4-Home-Address ]
                   [ Session-Timeout ]

                   [ User-Name ]
                   ...
                 * [ AVP ]

6.3.  MAG to LMA Security Association Setup

   Proxy MIPv6 MAG to LMA security is based on IPSec [10] and
   Encapsulating Security Payload (ESP) [11] should be used to protect
   all traffic between the MAG and the LMA.  The SA between the MAG and
   the LMA may either be statically configured or created dynamically on
   need to basis, depending on the deployment.  IKEv2 [14] is
   recommended for the creation of the SA.  Other solutions are also
   possible.  The actual creation process of the SA is out of scope of
   this specification.  The purging of the dynamically created SA can be
   explicit or implicit.  The decision which purging method to apply is
   also specific to a deployment.

   Depending on the dynamic SA creation method, either NASREQ or EAP
   Diameter applications may be used between the LMA and the home
   network AAA.  The MAG acts always as the IKE initiator.  The identity
   used during the authentication is the identity of the MAG.
   Therefore, the credentials used for the authentication are also MAG
   specific.  During the MAG to LMA SA creation the LMA SHOULD include
   the IP address of the MAG in the request message.

   The dynamic creation of the MAG to LMA SA gets triggered by a MN
   trying to attach to a MAG that does not have an exiting SA with the
   AAA assigned LMA.  The creation of the SA is started after the MN has
   successfully authenticated to the PMIPv6 domain.  If the creation of
   the MAG to LMA tunnel fails for a reason or other, the MAG should use
   access technology specific mechanisms to detach the MN from the
   network.  Cases where the access authentication completes
   successfully but the SA creation between the MAG and the LMA fails is
   usually a consequence of misconfiguration.




Korhonen, et al.          Expires May 17, 2008                 [Page 16]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


6.4.  Accounting at LMA

   The accounting at the LMA to HAAA interface is based on the [6].  The
   application identifier used for accounting is the Diameter Base
   Accounting (3) [9].

   TBD.


7.  Proxy Mobile IPv6 Session Management

   Concerning a PMIPv6 session, the AAAH MAY maintain a state.  The LMA
   and the MAG MUST support the Authorization Session State Machine
   defined in [9].  Diameter session termination related commands
   described in the following sections may be exchanged between the LMA
   and the HAAA.

   The actual PMIPv6 session termination procedures take place at PMIPv6
   protocol level and are out of scope of this document.

7.1.  Session Termination Request - Command

   The LMA or the MAG MAY send the Session-Termination-Request (STR)
   command [9] to the HAAA and inform the termination of an ongoing
   PMIPv6 session is in progress.

7.2.  Session Termination Answer - Command

   The Session-Termination-Answer (STA) [9] is sent by the HAAA to
   acknowledge the termination of a PMIPv6 session.

7.3.  Abort Session Request - Command

   The HAAA MAY send the Abort-Session-Request (ACR) command [9] to the
   LMA or to the MAG and request termination of a PMIPv6 session.

7.4.  Abort Session Answer - Command

   The Abort-Session-Answer (ASA) command [9]is sent by the LMA or the
   MAG to acknowledge that the termination of a PMIPv6 session.


8.  Attribute Value Pair Occurrence Tables

   The following tables list the PMIPv6 MAG to HAAA interface and LMA to
   HAAA interface AVPs including those that are defined in [3].

   The Figure 2 contains the AVPs and their occurrences on the MAG to



Korhonen, et al.          Expires May 17, 2008                 [Page 17]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   HAAA interface.  The AVPs that are part of grouped AVP are not listed
   in the table, rather only the grouped AVP is listed.


                                     +---------------------------+
                                     |        Command-Code       |
                                     |-------+-------+-----+-----+
      Attribute Name                 |  DER  |  DEA  | AAR | AAA |
      -------------------------------+-------+-------+-----+-----+
      PMIP6-MAG-Address              |  0-1  |  0-1  | 0-1 | 0-1 |
      PMIP6-DHCP-Address             |   0   |  0+   |  0  | 0+  |
      MIP6-Agent-Info                |   0   |  0+   |  0  | 0+  |
      MIP6-Feature-Vector            |  0-1  |  0-1  | 0-1 | 0-1 |
      PMIP6-IPv4-Home-Address        |   0   |  0-1  |  0  | 0-1 |
      PMIP6-MN-FQDN                  |   0   |  0-1  |  0  | 0-1 |
      PMIP6-Home-Prefix              |   0   |  0-1  |  0  | 0-1 |
      Chargeable-User-Identity       |  0-1  |  0-1  | 0-1 | 0-1 |
      Calling-Station-Id             |  0-1  |   0   | 0-1 |  0  |
                                     +-------+-------+-----+-----+

    Figure 2: MAG to HAAA Interface DER, DEA, AAR and AAA Commands AVPs

   The Figure 3 contains the AVPs and their occurrences on the LMA to
   HAAA interface.  The AVPs that are part of grouped AVP are not listed
   in the table, rather only the grouped AVP is listed.  This interface
   is essentially for authorizing the PBU, not for the dynamic creation
   of the MAG to LMA SA.


                                     +---------------+
                                     | Command-Code  |
                                     |-------+-------+
      Attribute Name                 |  AAR  |  AAA  |
      -------------------------------+-------+-------+
      PMIP6-MAG-Address              |  0-1  |   0   |
      PMIP6-IPv4-Home-Address        |  0-1  |  0-1  |
      PMIP6-Home-Prefix              |  0-1  |  0-1  |
      PMIP6-MN-FQDN                  |   0   |  0-1  |
      MIP6-Agent-Info                |  0-1  |   0   |
      MIP6-Feature-Vector            |  0-1  |  0-1  |
      Session-Timeout                |   0   |  0-1  |
      Chargeable-User-Id             |  0-1  |   0   |
      Calling-Station-Id             |  0-1  |   0   |
      Called-Station-Id              |  0-1  |   0   |
                                     +-------+-------+

         Figure 3: LMA to HAAA Interface AAR and AAA Commands AVPs




Korhonen, et al.          Expires May 17, 2008                 [Page 18]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   The following table describes the Diameter AVPs code values, types,
   possible flag values, and whether the AVP MAY be encrypted.  The
   Diameter base protocol specification [9] specifies the AVP Flags
   rules for AVPs in section 4.5.  Due to space constraints, the short
   form DiamIdent is used to represent DiameterIdentity and OctetStr is
   used to represent OctetString.

                                            +---------------------+
                                            |    AVP Flag rules   |
                                            +----+-----+----+-----+----+
                     AVP  Section           |    |     |SHLD|MUST |    |
  Attribute Name     Code Defined Data Type |MUST| MAY |NOT |NOT  |Encr|
  ------------------------------------------+----+-----+----+-----+----+
  PMIP6-MAG-Address  TBD  4.1     Address   |    | P,M |    |  V  | Y  |
  MIP6-Agent-Info    TBD  4.2     Grouped   |    | P,M |    |  V  | Y  |
  PMIP6-IPv4-Home-                          |    |     |    |     |    |
      Address        TBD  4.3     Address   |    | P,M |    |  V  | Y  |
  PMIP6-DHCP-Address TBD  4.4     Address   |    |     |    |  V  | Y  |
  PMIP6-Home-Prefix  TBD  4.5     Address   |    | P,M |    |  V  | Y  |
  PMIP6-MN-FQDN      TBD  4.6     DiamIdent |    | P,M |    |  V  | Y  |
  MIP6-Feature-                             |    |     |    |     |    |
      Vector         TBD  4.7     Unsigned64|    | P,M |    |  V  | Y  |
  Chargeable-User-                          |    |     |    |     |    |
      Identity        89  4.8     OctetStr  |    | P,M |    |  V  | Y  |
  Calling-Station-Id  31  4.9     UTF8String|    | P,M |    |  V  | Y  |
  Called-Station-Id   30  4.10    UTF8String|    | P,M |    |  V  | Y  |
  Session-Timeout     27  4.11    Unsigned32|    | P,M |    |  V  | Y  |
  ------------------------------------------+----+-----+----+-----+----+

                      Figure 4: AVP Flag Rules Table


9.  IANA Considerations

9.1.  Attribute Value Pair Codes

   This specification defines the following new AVPs:

     PMIP6-MAG-Address           is set to TBD
     PMIP6-DHCP-Address          is set to TBD
     PMIP6-MN-FQDN               is set to TBD
     PMIP6-Home-Prefix           is set to TBD
     PMIP6-IPv4-Home-Address     is set to TBD








Korhonen, et al.          Expires May 17, 2008                 [Page 19]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


9.2.  Namespaces

   This specification defines new values to the Mobility Capability
   registry (see [3]) for use with the MIP6-Feature-Vector AVP:

  Token                             | Value                | Description
  ----------------------------------+----------------------+------------
  PMIP6_SUPPORTED                   | 0x0000000100000000   | [RFC TBD]
  IP4_HOA_SUPPORTED                 | 0x0000000200000000   | [RFC TBD]
  LOCAL_MAG_ROUTING_SUPPORTED       | 0x0000000400000000   | [RFC TBD]
  DNS_UPDATE_BY_MAG                 | 0x0000001000000000   | [RFC TBD]

9.3.  Application Identifiers

   This specification requires IANA to allocate a new value for
   "Diameter Proxy Mobile IPv6" (PMIP6) from the Application Identifier
   namespace defined in [9].

9.4.  Result-Code AVP Values

   This specification requests IANA to allocate a new value to the
   Result-Code AVP (AVP Code 268) address space within the Permanent
   Failures category (5xxx) defined in [9]:

     DIAMETER_PMIP6_AUTHORIZATION_FAILED  is set to TBD


10.  Security Considerations

   TBD


11.  Acknowledgements

   Jouni Korhonen would like to thank TEKES MERCoNe project for
   providing funding to work on this document.


12.  References

12.1.  Normative References

   [1]   Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K., and
         B. Patil, "Proxy Mobile IPv6", draft-ietf-netlmm-proxymip6-07
         (work in progress), November 2007.

   [2]   Wakikawa, R. and S. Gundavelli, "IPv4 Support for Proxy Mobile
         IPv6", draft-ietf-netlmm-pmip6-ipv4-support-01 (work in



Korhonen, et al.          Expires May 17, 2008                 [Page 20]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


         progress), July 2007.

   [3]   Korhonen, J., Bournelle, J., Tschofenig, H., Perkins, C., and
         K. Chowdhury, "Diameter Mobile IPv6: Support for Network Access
         Server to Diameter Server  Interaction",
         draft-ietf-dime-mip6-integrated-06 (work in progress),
         November 2007.

   [4]   Bradner, S., "Key words for use in RFCs to Indicate Requirement
         Levels", BCP 14, RFC 2119, March 1997.

   [5]   Adrangi, F., Lior, A., Korhonen, J., and J. Loughney,
         "Chargeable User Identity", RFC 4372, January 2006.

   [6]   Calhoun, P., Zorn, G., Spence, D., and D. Mitton, "Diameter
         Network Access Server Application", RFC 4005, August 2005.

   [7]   Eronen, P., Hiller, T., and G. Zorn, "Diameter Extensible
         Authentication Protocol (EAP) Application", RFC 4072,
         August 2005.

   [8]   Aboba, B., Beadles, M., Arkko, J., and P. Eronen, "The Network
         Access Identifier", RFC 4282, December 2005.

   [9]   Calhoun, P., Loughney, J., Guttman, E., Zorn, G., and J. Arkko,
         "Diameter Base Protocol", RFC 3588, September 2003.

   [10]  Kent, S. and K. Seo, "Security Architecture for the Internet
         Protocol", RFC 4301, December 2005.

   [11]  Kent, S., "IP Encapsulating Security Payload (ESP)", RFC 4303,
         December 2005.

12.2.  Informative References

   [12]  Manner, J. and M. Kojo, "Mobility Related Terminology",
         RFC 3753, June 2004.

   [13]  Aboba, B., Blunk, L., Vollbrecht, J., Carlson, J., and H.
         Levkowetz, "Extensible Authentication Protocol (EAP)",
         RFC 3748, June 2004.

   [14]  Kaufman, C., "Internet Key Exchange (IKEv2) Protocol",
         RFC 4306, December 2005.

   [15]  Soliman, H., "Mobile IPv6 support for dual stack Hosts and
         Routers (DSMIPv6)", draft-ietf-mip6-nemo-v4traversal-05 (work
         in progress), July 2007.



Korhonen, et al.          Expires May 17, 2008                 [Page 21]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


   [16]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support in
         IPv6", RFC 3775, June 2004.

   [17]  Damic, D., "Proxy Mobile IPv6 indication and discovery",
         draft-damic-netlmm-pmip6-ind-discover-01 (work in progress),
         June 2007.

   [18]  Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury,
         "Mobile Node Identifier Option for Mobile IPv6 (MIPv6)",
         RFC 4283, November 2005.

   [19]  Korhonen, J., Nilsson, U., and V. Devarapalli, "Service
         Selection for Mobile IPv6", draft-korhonen-mip6-service-04
         (work in progress), October 2007.


Authors' Addresses

   Jouni Korhonen (editor)
   TeliaSonera
   Teollisuuskatu 13
   Sonera  FIN-00051
   Finland

   Email: jouni.korhonen@teliasonera.com


   Julien Bournelle
   France Telecom R&D
   38-4O rue du general Leclerc
   Issy-Les-Moulineaux  92794
   France

   Email: julien.bournelle@orange-ftgroup.com


   Kuntal Chowdhury
   Starent Networks
   30 International Place
   Tewksbury  MA  01876
   US

   Phone: +1 214 550 1416
   Email: kchowdhury@starentnetworks.com







Korhonen, et al.          Expires May 17, 2008                 [Page 22]

Internet-Draft   Diameter Support for Proxy Mobile IPv6    November 2007


Full Copyright Statement

   Copyright (C) The IETF Trust (2007).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Korhonen, et al.          Expires May 17, 2008                 [Page 23]

